tap "farion1231/ccswitch"
tap "homebrew/services"
tap "possatti/possatti"
tap "steipete/tap"
tap "thezoraiz/ascii-image-converter"

brew "ack"
brew "bat"
brew "broot"
brew "cabextract"
brew "clang-format"
brew "cloc"
brew "cmake"
brew "cmatrix"
brew "code2prompt"
brew "docker"
brew "doxygen"
brew "duckdb"
brew "dust"
brew "fd"
brew "ffmpegthumbnailer"
brew "fpp"
brew "fzf"
brew "gh"
brew "git"
brew "git-lfs"
brew "git-open"
brew "glow"
brew "go"
brew "graphviz"
brew "htop"
brew "httpd"
brew "lazygit"
brew "libelf"
brew "llvm@14"
brew "lnav"
brew "lsd"
brew "mercurial"
brew "neofetch"
brew "neovim"
brew "nginx"
brew "node"
brew "node@24"
brew "openjdk@17"
brew "openssh"
brew "openssl@1.1"
brew "pandoc"
brew "pdftk-java"
brew "php"
brew "pipx"
brew "poppler"
brew "possatti/possatti/pokemonsay"
brew "pstree"
brew "pup"
brew "python-matplotlib"
brew "python@3.11"
brew "python@3.12"
brew "qpdf"
brew "ripgrep"
brew "rsync"
brew "rust"
brew "starship"
brew "taglib"
brew "tesseract-lang"
brew "thezoraiz/ascii-image-converter/ascii-image-converter"
brew "tldr"
brew "tmux"
brew "tree"
brew "visidata"
brew "wget"
brew "yazi"
brew "zoxide"
brew "zplug"
brew "zsh-completions"

cask "bartender"
cask "cc-switch"
cask "codexbar"
cask "eul"
cask "libreoffice"
cask "rar"
cask "steam"
